# a, b, c = int(input()), int(input()), int(input())
# if (a + b) % 2 != 0:
#     print('YES')
# elif (b + c) % 2 != 0:
#     print('YES')                      # задача 2 которую сначала я не поняла
#
# elif (a + c) % 2 != 0:
#     print('YES')
# else:
#     print('NO')


# a = 5
# if a % 2 == 0:
#     print('Четное число')       #чтобы узнать четность числа , присваеваем переменной а число четность которого хотим
# else:                                   #проверить. пишем условие: если остаток деления переменной ф на 2 равно 0
#     print('Нечентное число'                 #вывести на экран "четное число" если нет то "нечетное число'


# b = 6
# if b % 2 == 0:
#     print('четное число')               #те же условия, вывели четно число
# else:
#     print('нечетное число')

